Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: Understand how different API calls to your closures can affect your app.
ja: あなたのクロージャに対する異なるAPI呼び出しがどのようにあなたのアプリに影響を与えられるかを理解します。

source: Understand the Conversion Rules
ja: 変換規則を理解する

source: Understand the constraints of imported Obj-C lightweight generic type declarations.
ja: インポートされたObj-C軽量総称体型宣言の制約を理解します。

source: Unicode
ja: ユニコード

source: Unions
ja: 共用体

source: Unique for the lifetime of a process (e.g. global incrementing integers).
ja: あるプロセスの存続期間に対して特有（たとえば、グローバルに漸増している整数）。

source: Unique for the lifetime of an object (e.g. object identifiers).
ja: あるオブジェクトの存続期間に対して特有（たとえば、オブジェクト識別子）

source: Unique within the current collection (e.g. collection index).
ja: 現在のコレクション内で特有（たとえば、コレクションインデックス）

source: Uniqueness Checking
ja: 特有性の検査

source: Unless the collection conforms to the BidirectionalCollection protocol, start must be less than or equal to end.
ja: コレクションがBidirectionalCollectionプロトコルに準拠しない場合は、startはendより少ないか等しくなければなりません。

source: Unless the collection guarantees random-access performance, calculating count can be an O(n) operation.
ja: そのコレクションが無作為アクセス性能を保証しない限り、countの算出は、O(n)演算であるはずです。

source: Unlike Array and ContiguousArray, the starting index for an ArraySlice instance isn’t always zero.
ja: ArrayおよびContiguousArrayとは違い、ArraySliceインスタンスのインデックスの始まりは必ずしもゼロではありません。

source: Unlike UnsafeMutablePointer<Pointee>, AutoreleasingUnsafeMutablePointer<Pointee> must reference storage that does not own a reference count to the referenced value.
ja: UnsafeMutablePointer<Pointee>とは違い、AutoreleasingUnsafeMutablePointer<Pointee>は、参照される値への参照カウントを保有しないストレージを参照しなければなりません。

source: Unlike in other programming languages, in Swift, integers and strings cannot be used where a Boolean value is required.
ja: 他のプログラミング言語とは違い、Swiftではブール値が必要とされるところで整数と文字列は使用できません。

source: Unlike the key-based subscript, the index-based subscript returns the corresponding key-value pair as a non-optional tuple.
ja: キー基盤の添え字と違い、インデックス基盤の添え字は該当するキー値ペアを非オプショナルのタプルとして返します。

source: Unlike traditional truncating multiplication, the multipliedFullWidth(by:) method returns a tuple containing both the high and low parts of the product of this value and other.
ja: 従来的な切り詰め乗算と違って、multipliedFullWidth(by:)メソッドは、この値とotherの積のhighおよびlow部分の両方を含んでいるタプルを返します。

source: Unnamed Structure and Union Fields
ja: 無名の構造体および共用体のフィールド

source: Unnamed fields consist of a nested struct or union type with named fields.
ja: 無名フィールドは、入れ子にされたstructまたはunionで名前付きフィールドを持つものから成ります。

source: UnsafeMutablePointer’s operations, by contrast, assume that the referenced storage owns values loaded from or stored to it.
ja: UnsafeMutablePointerの行う操作は、対照的に、参照されるストレージがそれからロードされたりそれへと格納される値を所有すると仮定します。

source: UnsignedInteger Implementations
ja: 符号なし整数実装

source: Unstructured Concurrency
ja: 構造化されない並行性

source: Until reaching the number of elements to drop, this iterator calls next() on its base iterator and discards the result.
ja: 抜かす要素の数に到達するまで、このイテレータは、next()をそれの基底イテレータ上で呼び出します、そして結果を廃棄します。

source: Until reaching the number of elements to include, this iterator calls next() on its base iterator and passes through the result.
ja: 抜かす要素の数に到達するまで、このイテレータは、next()をそれの基底イテレータ上で呼び出します、そして結果を廃棄します。

source: Update an existing value by assigning a new value to a key that already exists in the dictionary.
ja: すでに辞書に存在するキーに新しい値を割り当てることで、既存の値を更新してください。

source: Updates the value stored in the dictionary for the given key, or adds a new key-value pair if the key does not exist.
ja: 辞書に格納される値を指定されたキーに対して更新します、またはそのキーが存在しないならば新しいキー値ペアを追加します。

source: Upon reaching 6, the sequence ends:
ja: 6に到達することで、そのシーケンスは終わります：

source: Uppercase characters vary under case-conversion to lowercase, but not when converted to uppercase.
ja: アッパーケース文字は、ローワーケースへのケース変換のもとでは変動します、しかしアッパーケースに変換される時はそうではありません。

source: Use drop(while:) to omit elements from an asynchronous sequence until the element received meets a condition you specify.
ja: drop(while:)を使うことで要素を非同期シーケンスから、その受け取った要素があなたが指定する条件に合うまで省いてください。

source: Use dropFirst(_:) when you want to drop the first n elements from the base sequence and pass through the remaining elements.
ja: dropFirst(_:)を使ってください、あなたが最初のn要素を基底シーケンスから抜かす、そして残っている要素をずっと渡したい場合は。

source: Use prefix(_:) to reduce the number of elements produced by the asynchronous sequence.
ja: prefix(_:)を使って非同期シーケンスによって生み出された要素の数を減らしてください。

source: Use prefix(while:) to produce values while elements from the base sequence meet a condition you specify.
ja: prefix(while:)を使うことで、基底シーケンスからの要素があなたが指定する条件に合う間ずっと値を生み出してください。

source: Use unsafeDowncast(_:to:) only when you are confident that x is T always evaluates to true, and only after x as! T has proven to be a performance problem.
ja: unsafeDowncast(_:to:)は、あなたがx is Tは常にtrueに評価されることを確信している場合にのみ、そしてx as! Tが性能問題をもつと証明された後にのみ使ってください。

source: Use startIndex and endIndex as the bounds for any element access, instead of 0 and count.
ja: startIndexおよびendIndexをその境界としてあらゆる要素アクセスのために使ってください、0およびcountではなく。

source: Use All Significant Properties for Equatable and Hashable
ja: すべての重要プロパティをequatableとhashableに対して使う

source: Use Classes When You Need Objective-C Interoperability
ja: クラスをあなたがObjective-C互換性を必要とする場合に使ってください

source: Use Classes When You Need to Control Identity
ja: あなたが同一性を制御する必要がある場合はクラスを使ってください

source: Use Functions and Generics Instead of Complex Macros
ja: 関数と総称体を複雑なマクロの代わりに使う

source: Use Memory Managed Objects
ja: メモリ管理オブジェクトを使う

source: Use Structures When You Don't Control Identity
ja: あなたが同一性を制御しない場合は構造体を使ってください

source: Use Structures and Protocols to Model Inheritance and Share Behavior
ja: 構造体とプロトコルを使って挙動の継承と共有をモデル化してください

source: Use a CVaListPointer to Call Variadic Functions
ja: CVaListPointerを使って可変長引数関数を呼び出す

source: Use bridged Foundation types in your Swift codebase to work with dates, times, and other values.
ja: ブリッジされたFoundation型をあなたのSwiftコード基盤において使って、日付、時刻、および他の値を扱います。

source: Use bridged reference types when you need reference semantics or Foundation-specific behavior.
ja: ブリッジされた参照型を、あなたが参照意味論またはFoundation特有の挙動を必要とする場合に使ってください。

source: Use care when calling isKnownUniquelyReferenced(_:) from within a Boolean expression.
ja: isKnownUniquelyReferenced(_:)をブール式の内部から呼び出すとき注意を払ってください。

source: Use classes and other declarations from your Objective-C code with the same Swift syntax you use for system classes.
ja: クラスと他の宣言をあなたのObjective-Cコードからあなたがシステムクラスに使うのと同じSwift構文で使ってください。

source: Use classes and other declarations from your custom Objective-C code with the same Swift syntax you use for system classes.
ja: クラスと他の宣言をあなたのあつらえのObjective-Cコードからあなたがシステムクラスに使うのと同じSwift構文で使ってください。

source: Use classes when you need Objective-C interoperability.
ja: クラスを、あなたがObjective-C互換性を必要とする場合に使ってください。

source: Use classes when you need to control the identity of the data you're modeling.
ja: クラスを、あなたがモデル化しているデータの同一性を制御する必要がある場合に使ってください。

source: Use classes when you need your instances to have this kind of identity.
ja: あなたのインスタンスがその種の同一性を持つことをあなたが必要とする場合は、クラスを使ってください。

source: Use enumerations to capture and track the state of your app.
ja: 列挙を使ってあなたのアプリの状態をキャプチャおよび追跡します。

source: Use imported C-defined macros as constants.
ja: インポートされたC定義のマクロを定数として使います。

source: Use native Swift syntax to interoperate with types and functions in C and Objective-C.
ja: 本来のSwift構文を使ってCおよびObjective-Cでの型および関数と相互作用します。

source: Use selectors and key paths to interact with dynamic Objective-C APIs.
ja: セレクタとキーパスを使って動的Objective-C APIと相互作用してます。

source: Use string interpolation to include one or more expressions in a string literal, wrapped in a set of parentheses and prefixed by a backslash.
ja: 文字列補間を使って文字列リテラルの中に１つ以上の式を、一組の丸括弧に包んでひとつのバックスラッシュを前に置いて、含めてください。

source: Use structures along with protocols to adopt behavior by sharing implementations.
ja: 構造体をそれだけでなくプロトコルと一緒に使うことで、実装を共有することによる挙動を取り入れてください。

source: Use structures by default.
ja: 構造体を、通常は使ってください。

source: Use structures to represent common kinds of data.
ja: 構造体を使って、通常の種類のデータを表してください。

source: Use structures when you're modeling data that contains information about an entity with an identity that you don't control.
ja: あなたが制御を行わない同一性をもつある存在についての情報を含むデータをあなたがモデル化する場合は、構造体を使ってください。

source: Use the FixedWidthInteger protocol as a constraint or extension point when writing operations that depend on bit shifting, performing bitwise operations, catching overflows, or having access to the maximum or minimum representable value of a type.
ja: ビットシフト、ビット単位演算の実行、オーバーフローのキャッチ、またはある型の最大限または最小限表現可能な値へのアクセスに依存する演算を記述する場合に、FixedWidthIntegerプロトコルを制約または拡張ポイントとして使ってください。

source: Use the Identifiable protocol to provide a stable notion of identity to a class or value type.
ja: Identifiableプロトコルを使って、ある安定した同一性の概念をあるクラスまたは値型に提供してください。

source: Use the advanced(by:) method in generic code to offset a value by a specified distance.
ja: advanced(by:)メソッドを総称体コードにおいて使用して、ある値を指定された隔たりだけオフセットしてください。

source: Use the combine closure to select a value to use in the returned dictionary, or to combine existing and new values.
ja: combineクロージャを使ってある値を選択することで、返される辞書において使ってください、または既存および新規の値を結合してください。

source: Use the combine closure to select a value to use in the updated dictionary, or to combine existing and new values.
ja: combineクロージャを使ってある値を選択することで更新された辞書において使ってください、または既存のものと新しい値を結合してください。

source: Use the compactMap(_:) method to transform every element received from a base asynchronous sequence, while also discarding any nil results from the closure.
ja: compactMap(_:)メソッドを使うことで、基底非同期シーケンスから受け取ったあらゆる要素を変換してください、そして一方でまたあらゆるnil結果をクロージャから廃棄して。

source: Use the first and last properties for safe access to the value of the array’s first and last elements.
ja: 配列の最初と最後の要素の値に対する安全なアクセスのためにfirstおよびlastプロパティを使ってください。

source: Use the init(bitPattern:) initializer for the destination type.
ja: 行き先の型のためのinit(bitPattern:)イニシャライザを使ってください。

source: Use the init(clamping:) initializer to create a new instance of a binary integer type where out-of-range values are clamped to the representable range of the type.
ja: init(clamping:)イニシャライザを使って、バイナリ整数型の新しいインスタンスを作成してください、そこにおいて範囲外の値はその型の表現可能な範囲に固定されます。

source: Use the init(truncatingIfNeeded:) initializer to create a new instance with the same bit pattern as the passed value, extending or truncating the value’s representation as necessary.
ja: init(truncatingIfNeeded:)イニシャライザを使って、渡された値と同じビットパターンを持つ新しいインスタンスを、必要ならばその値の表現を拡張または切り詰めて作成してください。

source: Use the init?(exactly:) initializer to create a new instance after checking whether the passed value is representable.
ja: init?(exactly:)イニシャライザを使うことで、その渡された値が表現可能であるかどうか調べた後に新しいインスタンスを作成してください。

source: Use the isEmpty property to check quickly whether an array has any elements, or use the count property to find the number of elements in the array.
ja: isEmptyプロパティを使って、ある配列が要素を持つかどうか素早く確認してください、またはcountを使うことで配列中の要素の数を調べてください。

source: Use the map(_:) method to transform every element received from a base asynchronous sequence.
ja: map(_:)メソッドを使うことで、基底非同期シーケンスから受け取ったあらゆる要素を変換してください。

source: Use the max(by:) method to determine the index of the day with the most absences.
ja: max(by:)メソッドを使って最も欠席者の多い日付のインデックスを判定してください。

source: Use the reduce(_:_:) method to produce a single value from the elements of an entire sequence.
ja: reduce(_:_:)メソッドを使って、あるシーケンス全体の要素それらからある単一の値を生成してください。

source: Use the reduce(into:_:) method to produce a single value from the elements of an entire sequence.
ja: reduce(into:_:)メソッドを使って、あるシーケンス全体の要素それらからある単一の値を生成してください。

source: Use the shuffle() method to randomly reorder the elements of an array.
ja: shuffle()メソッドを使って、配列の要素を無作為に再配列してください。

source: Use the capacity and count properties to determine how many more elements the array can store without allocating larger storage.
ja: capacityやcountプロパティを使って、より大きなストレージに割り当てることなく更にどのくらいの要素をその配列が格納できるか判定してください。

source: Use the array’s capacity property to determine the size of the new storage.
ja: 配列のcapacityプロパティを使って新しいストレージの大きさを特定してください。

source: Use the casting operators (as, as!, or as?) or the unsafeDowncast(_:to:) function.
ja: キャスト演算子（as、as!、またはas?）またはunsafeDowncast(_:to:)関数を使ってください。

source: Use the closed range operator (...) to create a closed range of any type that conforms to the Comparable protocol.
ja: 完結範囲演算子（...）を使ってComparableプロトコルに準拠する何らかの型の配列を作成します。

source: Use the destination type’s init(truncatingIfNeeded:) or init(bitPattern:) initializer.
ja: 行き先の型のもつinit(truncatingIfNeeded:)またはinit(bitPattern:)イニシャライザを使ってください。

source: Use the destination type’s initializer or the numericCast(_:) function.
ja: 行き先の型のもつイニシャライザまたはnumericCast(_:)関数を使ってください。

source: Use the half-open range operator (..<) to create a range of any type that conforms to the Comparable protocol.
ja: 半開範囲演算子（..<）を使ってComparableプロトコルに準拠する何らかの型の配列を作成します。

source: Use the masking left shift operator (&<<) when you need to perform a shift and are sure that the shift amount is in the range 0...bitWidth.
ja: マスク左シフト演算子（&<<）を、あなたがあるシフトを実行する、そしてシフト量が範囲0...bitWidthの中であるのを確実にする必要がある場合に使ってください。

source: Use the masking right shift operator (&>>) when you need to perform a shift and are sure that the shift amount is in the range 0...bitWidth.
ja: マスク右シフト演算子（&>>）を、あなたがあるシフトを実行する、そしてシフト量が範囲0...bitWidthの中であるのを確実にする必要がある場合に使ってください。

source: Use the postfix range operator (postfix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 後置完結範囲演算子（後置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix closed range operator (prefix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置完結範囲演算子（前置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix half-open range operator (prefix ..<) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置半開範囲演算子（前置..<）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use this function for internal sanity checks that are active during testing but do not impact performance of shipping code.
ja: この関数を本質的な正常性確認のために使ってください、それはテストの間は活動的ですが出荷コードの性能に影響はありません。

source: Use this function instead of unsafeBitcast(_:to:) because this function is more restrictive and still performs a check in debug builds.
ja: この関数をunsafeBitcast(_:to:)の代わりに使ってください、なぜならこの関数はより制限的で依然としてデバッグビルドにおいて検査を実行するからです。

source: Use this function only to convert the instance passed as x to a layout-compatible type when conversion through other means is not possible.
ja: この関数をxとして渡されるインスタンスをレイアウト互換の型へと、その変換が他の手段では可能でない場合に、変換するのにだけ使ってください。

source: Use this function to detect conditions that must prevent the program from proceeding, even in shipping code.
ja: この関数を使って、続行することからプログラムを妨げなければならない条件を突き止めてください、出荷コードにおいてもです。

source: Use this function to stop the program when control flow can only reach the call if your API was improperly used.
ja: あなたのAPIが誤って使われた場合にその呼び出しに制御の流れが届く時にだけこの関数を使ってプログラムを停止してください。

source: Use this function to stop the program, without impacting the performance of shipping code, when control flow is not expected to reach the call—for example, in the default case of a switch where you have knowledge that one of the other cases must be satisfied.
ja: この関数を使って、制御の流れが呼び出しに届くと予想されない場合に、出荷コードの性能に影響を与えることなく、プログラムを停止してください—例えば、switchのdefaultケース節において、そこにおいてあなたはそれ以前のケース節の１つが満たされなければならないことがわかっています。

source: Use this initializer around a range instead of typing all those numbers in an array literal.
ja: それらの数をすべて配列リテラルの中にタイプするの代わりに、ある範囲を取り囲むようにこのイニシャライザを使ってください。

source: Use this initializer to avoid intermediate reallocations of a dictionary’s storage buffer when you know how many key-value pairs you are adding to a dictionary after creation.
ja: どのくらい多くのキー値ペアをあなたが辞書に加えることになるかあなたが知っている場合は、このイニシャライザを使ってある辞書の持つストレージバッファの幾度もの中間的な再割り当てを回避してください。

source: Use this initializer to convert from another integer type when you know the value is within the bounds of this type.
ja: このイニシャライザを使って別の整数型から変換してください、値がこの型の境界の内部であるのをあなたが知っている場合は。

source: Use this initializer to create a Boolean by converting an MLDataValue with an underlying type of Int.
ja: このイニシャライザを使ってブールを作成してください、MLDataValueをある基礎をなす型のIntで変換することによって

source: Use this initializer to create a double by converting an MLDataValue with an underlying type of Double.
ja: このイニシャライザを使ってdoubleを作成してください、MLDataValueをある基礎をなす型のDoubleで変換することによって

source: Use this initializer to create an array by converting an MLDataValue with an underlying type of MLDataValue.DictionaryType.
ja: このイニシャライザを使って配列を作成してください、MLDataValueをある基礎をなす型のMLDataValue.DictionaryTypeで変換することによって。

source: Use this initializer to create an array by converting an MLDataValue with an underlying type of MLDataValue.SequenceType.
ja: このイニシャライザを使って配列を作成してください、MLDataValueをある基礎をなす型のMLDataValue.SequenceTypeで変換することによって

source: Use this initializer to create an array by converting an MLDataValue.DictionaryType.
ja: このイニシャライザを使って配列を作成してください、MLDataValue.DictionaryTypeを変換することによって。

source: Use this initializer to create an integer by converting an MLDataValue with an underlying type of Int.
ja: このイニシャライザを使って整数を作成してください、MLDataValueをある基礎をなす型のIntで変換することによって

source: Use this method instead of key-based subscripting when you need to know whether the new value supplants the value of an existing key.
ja: 新しい値が既存のキーの値に取って代わるかどうかをあなたが知る必要がある場合は、キーに基づく添え字を使うのではなくこのメソッドを使ってください。

source: Use this method only if you need the concrete range it produces.
ja: それが生成する具体的な範囲をあなたが必要とする場合にのみ、このメソッドを使ってください。

source: Use this method to append a single element to the end of a mutable array.
ja: このメソッドを使ってある単一の要素を可変の配列の終わりに加えてください。

source: Use this method to append the elements of a sequence to the end of this array.
ja: このメソッドを使うことで、あるシーケンスに属する要素をこの配列の終わりに追加してください。

source: Use this method to calculate the full result of a product that would otherwise overflow.
ja: このメソッドを使うことで、そうしなければオーバーフローするであろう積の完全な結果を計算してください。

source: Use this method to calculate the quotient and remainder of a division at the same time.
ja: このメソッドを使って、除算の商と余りを同時に計算してください。

source: Use this method to extend this key path to the value type of another key path.
ja: このメソッドを使うことで、このキーパスを別のキーパスの値型にまで広げてください。

source: Use this method to generate a floating-point value within a specific range when you are using a custom random number generator.
ja: このメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、特定の範囲の内のある浮動小数点値を作成してください。

source: Use this method to generate a floating-point value within a specific range.
ja: このメソッドを使って、特定の範囲の内のある浮動小数点値を作成してください。

source: Use this method to generate a random Boolean value when you are using a custom random number generator.
ja: あなたはこのメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、無作為なブール値を生成します。

source: Use this method to generate an integer within a specific range when you are using a custom random number generator.
ja: このメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、特定の範囲の内のある整数を作成してください。

source: Use this method to generate an integer within a specific range.
ja: このメソッドを使って、特定の範囲の内のある整数を作成してください。

source: Use this method to receive a dictionary with non-optional values when your transformation produces optional values.
ja: このメソッドを使うことで非オプショナル値での辞書を受け取ってください、あなたの変換がオプショナル値を生成する時に。

source: Use this method to receive a single-level asynchronous sequence when your transformation produces an asynchronous sequence for each element.
ja: このメソッドを使って、単一階層の非同期シーケンスを受け取ってください、あなたの変換が各要素に対してひとつの非同期シーケンスを生み出す時は。

source: Use this method to receive a single-level collection when your transformation produces a sequence or collection for each element.
ja: あなたの変換が各要素に対してひとつのシーケンスまたはコレクションを生成する場合に、このメソッドを使って単一水準コレクションを受け取ってください。

source: Use this method to receive an array of non-optional values when your transformation produces an optional value.
ja: このメソッドを使うことで非オプショナル値の配列を受け取ってください、あなたの変換がオプショナル値を生成する時に。

source: Use this method to receive an array of nonoptional values when your transformation produces an optional value.
ja: あなたの変換がオプショナル値を生成する場合に、このメソッドを使って非オプショナル値からなる配列を受け取ってください。

source: Use this method to remove every element in a collection that meets particular criteria.
ja: このメソッドを使って、コレクションの中の、特定の基準に合うすべての要素を除去してください。

source: Use this method to toggle a Boolean value from true to false or from false to true.
ja: このメソッドを使って、ブール値をtrueからfalseへとまたはfalseからtrueへと切り替えてください。

source: Use this method when the asynchronous sequence’s values don’t conform to Comparable, or when you want to apply a custom ordering to the sequence.
ja: このメソッドを、非同期シーケンスのもつ値それらがComparableに準拠しない時に、またはあなたがあるあつらえの順序付けをそのシーケンスに適用したい時に使ってください。

source: Use this operator to append the elements of a sequence to the end of range-replaceable collection with same Element type.
ja: この演算子を使って、あるシーケンスに属するいくらかの要素を同じElement型を持つ範囲置換可能なコレクションの終わりに加えてください。

source: Use this subscript when you want either the value for a particular key or, when that key is not present in the dictionary, a default value.
ja: あなたが特定のキーに対する値または、そのキーが辞書の中に存在しない時、省略時の値のどちらかを望む場合は、この添え字を使ってください。

source: User-Relevant Errors
ja: ユーザ関連のエラー

source: Using Delegates to Customize Object Behavior
ja: 委任先を使ってオブジェクト挙動をカスタマイズする

source: Using Enumerations as Errors
ja: 列挙をエラーとして使う

source: Using Imported Boolean values
ja: インポートされたブール値を使う

source: Using Imported C Functions in Swift
ja: インポートされたC関数をSwiftで使う

source: Using Imported C Macros in Swift
ja: インポートされたCマクロをSwiftで使う

source: Using Imported C Structs and Unions in Swift
ja: インポートされたC構造体と共用体をSwiftで使う

source: Using Imported Lightweight Generics in Swift
ja: インポートされた軽量総称体をSwiftにおいて使用する

source: Using Imported Protocol-Qualified Classes in Swift
ja: インポートされたプロトコル適格クラスをSwiftにおいて使用する

source: Using Key-Value Observing in Swift
ja: Swiftにおいてキー値監視を使用する

source: Using Objective-C Runtime Features in Swift
ja: Objective-Cランタイム機能をSwiftで使用する

source: Using a Boolean as a Data Value
ja: ブール値をデータ値として使う

source: Using a Closed Range as a Collection of Consecutive Values
ja: 完結範囲を隣接値のコレクションとして使用する

source: Using a Dictionary as a Data Value
ja: 辞書をデータ値として使う

source: Using a Double as a Data Value
ja: 不動小数点数をデータ値として使う

source: Using a negative number or an index equal to or greater than count triggers a runtime error.
ja: 負数をまたはcountと等しいかより大きいインデックスを使うことは、実行時エラーを引き起こします。

source: Using a negative value as rhs is the same as performing a left shift using abs(rhs).
ja: rhsとして負の値を使うことは、abs(rhs)を使って左シフトを実行するのと同じです。

source: Using a negative value as rhs is the same as performing a right shift with abs(rhs).
ja: 負の値をrhsとして使うことは、abs(rhs)を使って右シフトを実行するのと同じです。

source: Using a negative value for rhs performs a left shift using abs(rhs).
ja: rhsに負の値を使うことは、abs(rhs)を使って左シフトを実行します。

source: Using a negative value for rhs performs a right shift using abs(rhs).
ja: rhsに負の値を使うことは、abs(rhs)を使って右シフトを実行します。

source: Using a value for rhs that is greater than or equal to the bit width of lhs is an overshift, resulting in zero.
ja: rhsにlhsのビット幅より大きいか等しい値を使うことは、オーバーシフト、ゼロという結果になります。

source: Using a value for rhs that is greater than or equal to the bit width of lhs is an overshift.
ja: rhsにlhsのビット幅より大きいか等しい値を使うことは、オーバーシフトです。

source: Using an Integer as a Data Value
ja: 整数をデータ値として使う

source: Using any other value for rhs performs a left shift on lhs by that amount.
ja: rhsに何か他の値を使うことは、左シフトをlhs上でその量だけ行います。

source: Using any other value for rhs performs a right shift on lhs by that amount.
ja: rhsに何か他の値を使うことは、右シフトをlhs上でその量だけ行います。

source: Using different groups of properties in the two methods can lead to unexpected behavior or performance when using your custom type in sets and dictionaries.
ja: 異なるプロパティのグループを２つのメソッドにおいて使うことは、あなたのカスタム型を集合および辞書で使う場合に、予期しない挙動または性能に導きます。

source: Using structures makes it easier to reason about a portion of your code without needing to consider the whole state of your app.
ja: 構造体を使うことは、あなたのアプリの全体の状態を考える必要なしに、あなたのコードの一部について結論を下すことを簡単にします。

source: Using the forEach method is distinct from a for-in loop in two important ways:
ja: forEachメソッドを使うことは、for-inループとは２つの重要なやり方においてまったく異なります：
